{
    "profile": {
        "name": "PIYUSH RAI",
        "title": "Product Manager | Fintech & AI/ML | Digital Transformation & Data-Driven Strategy",
        "phone": "+91 6005044517",
        "email": "piyush07rai@gmail.com",
        "linkedin": "https://linkedin.com/in/piyush07rai"
    },
    "summary": "Product Management professional with 3.5+ years of experience driving digital transformation in the Banking and Financial Services sector. Proven success in building and scaling API-led digital products that reduced onboarding time by 80%, lowered transaction fallout rates by 70%, and increased client adoption by 30% YoY. Adept at defining product strategy, managing cross-functional delivery, and implementing KPI-driven decision frameworks. Skilled in leading end-to-end product strategy from ideation to execution, leveraging data, automation, and agile methodologies to enhance client experience and operational efficiency.",
    "experience": [
        {
            "role": "Product Manager - II",
            "company": "ICICI Bank",
            "location": "Mumbai, India",
            "duration": "06/2022 - Present",
            "description": "Part of the Transaction Banking Group, catering to cash management requirements of corporates through invisible banking (APIs)",
            "bullets": [
                "Led the digital cash management transformation program, building a unified Platform for Digital Payments & Collections (UPI, RTGS, NEFT, API-based initiation), consolidating multiple legacy systems into a microservices-based architecture.",
                "Developed and launched self-service developer's portal for API onboarding, cutting onboarding time from 1 to 2 weeks to 3-4 hours and driving 30% YoY increase in client adoption.",
                "Spearheaded migration of 800+ Corporate clients from legacy API gateway, decommissioning outdated infrastructure within 3 quarters with zero disruptions.",
                "Designed and rolled out real-time transaction monitoring dashboard, leveraging data-driven anomaly detection to enable faster root-cause analysis and reducing client complaints by 6% MoM.",
                "Built a polling mechanism for outbound APIs, lowering fallout rates by 70% through predictive transaction health checks.",
                "Launched DIY mode client onboarding platform for HTTPS and SFTP-based H2H services for corporate clients, ensuring secure and scalable STP file transfer processes.",
                "Built an API monetization framework (Charge Master), aligning pricing with business goals and creating new revenue opportunities.",
                "Created ROI models for strategic Products, using forecasting models and KPI benchmarking to drive data-driven investment decisions.",
                "Partnered with a 2,000+ member business team to analyse sales trends, client data, and adoption metrics, directly shaping the product roadmap and GTM strategy."
            ]
        },
        {
            "role": "Software Development Intern - Hyperworks",
            "company": "Altair Engineering",
            "location": "Bangalore, India",
            "duration": "03/2022 - 06/2022",
            "description": "Tech company offering engineering simulation software.",
            "bullets": [
                "Debugged and optimized C++ source code modules in Hyperworks, improving reliability and system performance.",
                "Automated identification of 200+ deprecated Hyperworks commands with Python, accelerating updates and ensuring seamless functionality. Collaborated within a 10-member team using Perforce version control, streamlining code management and ensuring milestone alignment."
            ]
        }
    ],
    "education": [
        {
            "degree": "B.Tech - Mechanical Engineering",
            "institution": "Indian Institute of Technology Jammu",
            "location": "Jammu, India",
            "year": "08/2018 - 05/2022",
            "details": "CGPA 7.73/10"
        }
    ],
    "skills": [
        {
            "category": "Product Strategy & Management",
            "items": "Product Roadmapping, Go to Market Strategy, KPIs Tracking, A/B Testing, Market & User Research"
        },
        {
            "category": "Agile & Delivery Management",
            "items": "Sprint Planning, Scrum & Kanban, UAT management, Release Planning, Continuous Improvement"
        },
        {
            "category": "Tools & APIs",
            "items": "SQL, Excel, Power BI, Figma, Python, Postman, Swagger, Confluence, REST APIs, Bulk APIs, AI/ML Fundamentals, JIRA"
        },
        {
            "category": "Certifications",
            "items": "API & Microservices, DevOps, Cloud Computing, Project Management - Agile & Scrum methodologies"
        }
    ],
    "projects": [
        {
            "title": "Sentiment Analysis",
            "duration": "05/2021 - 07/2021",
            "subtitle": "IIT Jammu",
            "description": "A project focused on sentiment analysis to classify sentiments from Twitter data",
            "bullets": [
                "Developed and evaluated a sentiment analysis model with 63% accuracy using NLP techniques",
                "Implemented Logistic Regression for sentiment classification, achieving a 15% improvement in detection accuracy"
            ]
        },
        {
            "title": "Learning Management System",
            "duration": "08/2020 - 12/2020",
            "subtitle": "IIT Jammu",
            "description": "A LMS project to automate assessments and improve user engagement",
            "bullets": [
                "Built an MCQ test system using Django, enabling role-based access and randomized evaluation",
                "Implemented email-based user authentication, progress tracking & randomized question pools"
            ]
        }
    ],
    "engagements": [
        {
            "title": "Research Achievement",
            "description": "Led a 7-member research team to achieve TRL 3, developing an experimental proof of concept for customizable prosthetic sockets, which has the potential to dramatically assist trans-tibial amputees."
        },
        {
            "title": "Community Involvement and Leadership",
            "description": "• Volunteer teacher for Senior Secondary Mathematics at Angelxpress NGO\n• IIT Jammu Basketball Team Captain (2019-2022) & Inter-IIT Sports Meet 2019"
        }
    ]
}