{
    "settings": {
        "layout": {
            "left": [
                "summary",
                "experience"
            ],
            "right": [
                "education",
                "skills",
                "projects",
                "engagements"
            ]
        },
        "titles": {
            "summary": "SUMMARY",
            "experience": "EXPERIENCE",
            "education": "EDUCATION",
            "skills": "SKILLS",
            "projects": "PROJECTS",
            "engagements": "ENGAGEMENTS"
        }
    },
    "profile": {
        "name": "PIYUSH RAI",
        "title": "Product Manager | Fintech & AI/ML | Digital Transformation & Data-Driven Strategy",
        "phone": "+91 6005044517",
        "email": "piyush07rai@gmail.com",
        "linkedin": "https://linkedin.com/in/piyush07rai"
    },
    "summary": "Product Management professional with 3.5+ years of experience driving digital transformation in the Banking and Financial Services sector. Proven success in building and scaling API-led digital products that reduced onboarding time by 80%, lowered transaction fallout rates by 70%, and increased client adoption by 30% YoY. Adept at defining product strategy, managing cross-functional delivery, and implementing KPI-driven decision frameworks. Skilled in leading end-to-end product strategy from ideation to execution, leveraging data, automation, and agile methodologies to enhance client experience and operational efficiency.",
    "experience": [
        {
            "role": "Product Manager - II",
            "company": "ICICI Bank",
            "location": "Mumbai, India",
            "duration": "06/2022 - Present",
            "description": "Own product strategy and architecture for enterprise-grade API infrastructure powering digital payments and cash management flows (UPI, RTGS, NEFT, H2H).",
            "bullets": [
                "Architected a Unified Digital Payments Platform (UDPP) consolidating 5+ legacy systems into a microservices-based orchestration layer enabling headless API initiation for corporate clients. Supporting high-volume transaction flows with 99.9% uptime.",
                "Built and scaled a self-service API Developer Portal, reducing Time-to-First-Call from 1–2 weeks to <4 hours and driving 30% YoY growth in API-led client adoption.",
                "Led legacy gateway decommissioning, migrating 800+ enterprise clients from SOAP-based infrastructure to RESTful APIs within 3 quarters, achieving zero downtime and full data integrity during transition.",
                "Designed and rolled out real-time transaction monitoring dashboards, leveraging data-driven anomaly detection to enable faster root-cause analysis and reducing client complaints by 6% MoM.",
                "Engineered a predictive transaction health framework (intelligent polling & anomaly detection), reducing transaction fallout rates by 70% and strengthening payment success metrics during partner bank downtimes.",
                "Launched a DIY H2H onboarding platform (HTTPS/SFTP-based STP file transfers), enabling secure, scalable integrations for Bulk Payments.",
                "Conceptualised and implemented an API monetisation engine (\"Charge Master\"), shifting from static pricing to volume-based tiering — unlocking new revenue streams and improving pricing transparency.",
                "Created ROI models for strategic Products, using forecasting models and KPI benchmarking to drive data-driven investment decisions for new Projects.",
                "Partnered with a 2,000+ member business team to analyse sales trends, client data, and adoption metrics, directly shaping the product roadmap and GTM strategy."
            ]
        },
        {
            "role": "Software Development Intern - Hyperworks",
            "company": "Altair Engineering",
            "location": "Bangalore, India",
            "duration": "03/2022 - 06/2022",
            "description": "Tech company offering engineering simulation software.",
            "bullets": [
                "Debugged and optimized C++ source code modules in Hyperworks, improving reliability and system performance.",
                "Automated identification of 200+ deprecated Hyperworks commands with Python, accelerating updates and ensuring seamless functionality.\nCollaborated within a 10-member team using Perforce version control, streamlining code management and ensuring milestone alignment."
            ]
        }
    ],
    "education": [
        {
            "degree": "B.Tech - Mechanical Engineering",
            "institution": "Indian Institute of Technology Jammu",
            "location": "Jammu, India",
            "year": "08/2018 - 05/2022",
            "details": "CGPA 7.73/10"
        }
    ],
    "skills": [
        {
            "category": "Product Strategy & Management",
            "items": "Product Roadmapping, Go to Market Strategy, KPIs Tracking, A/B Testing, Market & User Research"
        },
        {
            "category": "Agile & Delivery Management",
            "items": "Sprint Planning, Scrum & Kanban, UAT management, Release Planning, Continuous Improvement"
        },
        {
            "category": "Tools & APIs",
            "items": "SQL, Excel, Power BI, Figma, Python, Postman, Swagger, Confluence, REST APIs, Bulk APIs, AI/ML Fundamentals, JIRA"
        },
        {
            "category": "Certifications",
            "items": "API & Microservices, DevOps, Cloud Computing, Project Management - Agile & Scrum methodologies"
        }
    ],
    "projects": [
        {
            "title": "Sentiment Analysis",
            "duration": "05/2021 - 07/2021",
            "subtitle": "IIT Jammu",
            "description": "A project focused on sentiment analysis to classify sentiments from Twitter data",
            "bullets": [
                "Developed and evaluated a sentiment analysis model with 63% accuracy using NLP techniques",
                "Implemented Logistic Regression for sentiment classification, achieving a 15% improvement in detection accuracy"
            ]
        },
        {
            "title": "Learning Management System",
            "duration": "08/2020 - 12/2020",
            "subtitle": "IIT Jammu",
            "description": "A LMS project to automate assessments and improve user engagement",
            "bullets": [
                "Built an MCQ test system using Django, enabling role-based access and randomized evaluation",
                "Implemented email-based user authentication, progress tracking & randomized question pools"
            ]
        }
    ],
    "engagements": [
        {
            "title": "Research Achievement",
            "description": "Led a 7-member research team to achieve TRL 3, developing an experimental proof of concept for customizable prosthetic sockets, which has the potential to dramatically assist trans-tibial amputees."
        },
        {
            "title": "Community Involvement and Leadership",
            "description": "• Volunteer teacher for Senior Secondary Mathematics at Angelxpress NGO\n• IIT Jammu Basketball Team Captain (2019-2022) & Inter-IIT Sports Meet 2019"
        }
    ]
}