{
    "settings": {
        "layout": {
            "left": [
                "summary",
                "experience",
                "education"
            ],
            "right": [
                "skills",
                "projects",
                "engagements"
            ]
        },
        "titles": {
            "summary": "SUMMARY",
            "experience": "EXPERIENCE",
            "education": "EDUCATION",
            "skills": "SKILLS",
            "projects": "PROJECTS",
            "engagements": "ENGAGEMENTS"
        }
    },
    "profile": {
        "name": "PIYUSH RAI",
        "title": "Product Manager | Fintech & AI/ML | Digital Transformation & Data-Driven Strategy",
        "phone": "+91 6005044517",
        "email": "piyush07rai@gmail.com",
        "linkedin": "https://linkedin.com/in/piyush07rai"
    },
    "summary": "Product Manager with 4 years of experience building API-led platforms and scaling enterprise-grade digital systems. Proven track record of driving architecture modernization, improving operational resilience, and enabling self-serve product adoption. Combines engineering fluency with data-driven decision-making to prioritize high-impact roadmap investments.",
    "experience": [
        {
            "role": "Product Manager - II",
            "company": "ICICI Bank",
            "location": "Mumbai, India",
            "duration": "06/2022 - Present",
            "description": "Own product strategy and architecture for enterprise-grade API infrastructure powering digital payments and cash management flows (UPI, RTGS, NEFT, H2H).",
            "bullets": [
                "Architected a Unified Digital Payments Platform, consolidating 5+ legacy systems into a microservices-based orchestration layer, enabling headless API initiation for corporate clients. Supporting high-volume transaction flows with 99.9% uptime.",
                "Built and scaled a self-service API Developer Portal, reducing Time-to-First-Call from 1–2 weeks to <4 hours and driving 30% YoY growth in API-led client adoption.",
                "Led legacy gateway decommissioning, migrating 800+ enterprise clients from SOAP-based infrastructure to RESTful APIs within 3 quarters, achieving zero downtime and full data integrity during transition.",
                "Designed and rolled out real-time transaction monitoring dashboards, leveraging data-driven anomaly detection to enable faster root-cause analysis and reducing client complaints by 6% MoM.",
                "Engineered a predictive transaction health framework (intelligent polling & anomaly detection), reducing transaction fallout rates by 70% and strengthening payment success metrics during partner bank downtimes.",
                "Launched a DIY H2H onboarding platform (HTTPS/SFTP-based STP file transfers), enabling secure, scalable integrations for Bulk Payments.",
                "Conceptualised and implemented an API monetisation engine (\"Charge Master\"), shifting from static pricing to volume-based tiering — unlocking new revenue streams and improving pricing transparency.",
                "Created ROI models for strategic Products, using forecasting models and KPI benchmarking to drive data-driven investment decisions for new Projects.",
                "Partnered with a 2,000+ member business team to analyse sales trends, client data, and adoption metrics, directly shaping the product roadmap and GTM strategy."
            ]
        },
        {
            "role": "Software Development Intern - Hyperworks",
            "company": "Altair Engineering",
            "location": "Bangalore, India",
            "duration": "03/2022 - 06/2022",
            "description": "Tech company offering engineering simulation software.",
            "bullets": [
                "Debugged and optimized performance-critical C++ modules within the HyperWorks simulation engine, improving runtime stability and reducing recurring defect cycles across production builds.",
                "Built Python automation scripts to identify and refactor 200+ deprecated command patterns, accelerating version upgrades and ensuring backward compatibility across enterprise customer environments.",
                "Contributed to a shared production codebase using Perforce version control within a 10-member engineering team, participating in structured code reviews and release management processes."
            ]
        }
    ],
    "education": [
        {
            "degree": "B.Tech - Mechanical Engineering",
            "institution": "Indian Institute of Technology Jammu",
            "location": "Jammu, India",
            "year": "08/2018 - 05/2022",
            "details": "CGPA 7.73/10"
        }
    ],
    "skills": [
        {
            "category": "Product & Strategy",
            "items": "Product Roadmapping, Go to Market Strategy, KPIs Definition, A/B Testing, Market & User Research, RCA"
        },
        {
            "category": "Platform & API",
            "items": "API Lifecycle Management, RESTful API Design, Webhooks vs Polling, Idempotency Concepts, API Versioning, Microservices Architecture, System Design Fundamentals"
        },
        {
            "category": "Data & Observability",
            "items": "SQL, Excel, Funnel Analysis, Dashboarding (Power BI), Forecast Modeling, Adoption & Retention Metrics"
        },
        {
            "category": "Technical Foundation",
            "items": "Python, C++, JSON, OpenAPI/Swagger, Postman, Git/Perforce, Agile/Scrum, AI Tools"
        }
    ],
    "projects": [
        {
            "title": "Sentiment Analysis",
            "duration": "05/2021 - 07/2021",
            "subtitle": "IIT Jammu",
            "description": "A project focused on sentiment analysis to classify sentiments from Twitter data",
            "bullets": [
                "Developed and evaluated a sentiment analysis model with 63% accuracy using NLP techniques",
                "Implemented Logistic Regression for sentiment classification, achieving a 15% improvement in detection accuracy"
            ]
        },
        {
            "title": "Learning Management System",
            "duration": "08/2020 - 12/2020",
            "subtitle": "IIT Jammu",
            "description": "A LMS project to automate assessments and improve user engagement",
            "bullets": [
                "Built an MCQ test system using Django, enabling role-based access and randomized evaluation",
                "Implemented email-based user authentication, progress tracking & randomized question pools"
            ]
        }
    ],
    "engagements": [
        {
            "title": "Research Achievement",
            "description": "Led a 7-member research team to achieve TRL 3, developing an experimental proof of concept for customizable prosthetic sockets, which has the potential to dramatically assist trans-tibial amputees."
        },
        {
            "title": "Community Involvement and Leadership",
            "description": "• Volunteer teacher for Senior Secondary Mathematics at Angelxpress NGO\n• IIT Jammu Basketball Team Captain (2019-2022) & Inter-IIT Sports Meet 2019"
        }
    ]
}